Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70N19.atdf
      <value-group caption="" name="SUPC_SR__WKUPIS4">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS5">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS6">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS7">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS8">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS9">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS10">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS11">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS12">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS13">
        <value caption="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." name="DIS" value="0"/>
        <value caption="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
    </module>
    <module name="TC" caption="Timer Counter" id="6082" version="ZL">
      <register-group name="TC_CHANNEL" size="64">
        <register caption="Channel Control Register (channel = 0)" name="TC_CCR" offset="0x00" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 0)" name="TC_CMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR0__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR0__BURST"/>
          <bitfield caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR0__ETRGEDG"/>
          <bitfield caption="TIOAx or TIOBx External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR0__LDRA"/>
          <bitfield caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR0__LDRB"/>
          <bitfield caption="Loading Edge Subsampling Ratio" mask="0x00700000" name="SBSMPLR" values="TC_CMR0__SBSMPLR"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 0)" name="TC_SMMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Register AB (channel = 0)" name="TC_RAB" offset="0x0C" rw="R" size="4">
          <bitfield caption="Register A or Register B" mask="0xFFFFFFFF" name="RAB"/>
        </register>
