Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70N19.atdf
        <register caption="Channel Next Descriptor Control Register (chid = 0)" name="XDMAC_CNDC" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Channel x Next Descriptor Enable" mask="0x00000001" name="NDE" values="XDMAC_CNDC0__NDE"/>
          <bitfield caption="Channel x Next Descriptor Source Update" mask="0x00000002" name="NDSUP" values="XDMAC_CNDC0__NDSUP"/>
          <bitfield caption="Channel x Next Descriptor Destination Update" mask="0x00000004" name="NDDUP" values="XDMAC_CNDC0__NDDUP"/>
          <bitfield caption="Channel x Next Descriptor View" mask="0x00000018" name="NDVIEW" values="XDMAC_CNDC0__NDVIEW"/>
        </register>
        <register caption="Channel Microblock Control Register (chid = 0)" name="XDMAC_CUBC" offset="0x20" rw="RW" size="4">
          <bitfield caption="Channel x Microblock Length" mask="0x00FFFFFF" name="UBLEN"/>
        </register>
        <register caption="Channel Block Control Register (chid = 0)" name="XDMAC_CBC" offset="0x24" rw="RW" size="4">
          <bitfield caption="Channel x Block Length" mask="0x00000FFF" name="BLEN"/>
        </register>
        <register caption="Channel Configuration Register (chid = 0)" name="XDMAC_CC" offset="0x28" rw="RW" size="4">
          <bitfield caption="Channel x Transfer Type" mask="0x00000001" name="TYPE" values="XDMAC_CC0__TYPE"/>
          <bitfield caption="Channel x Memory Burst Size" mask="0x00000006" name="MBSIZE" values="XDMAC_CC0__MBSIZE"/>
          <bitfield caption="Channel x Synchronization" mask="0x00000010" name="DSYNC" values="XDMAC_CC0__DSYNC"/>
          <bitfield caption="Channel x Software Request Trigger" mask="0x00000040" name="SWREQ" values="XDMAC_CC0__SWREQ"/>
          <bitfield caption="Channel x Fill Block of Memory" mask="0x00000080" name="MEMSET" values="XDMAC_CC0__MEMSET"/>
          <bitfield caption="Channel x Chunk Size" mask="0x00000700" name="CSIZE" values="XDMAC_CC0__CSIZE"/>
          <bitfield caption="Channel x Data Width" mask="0x00001800" name="DWIDTH" values="XDMAC_CC0__DWIDTH"/>
          <bitfield caption="Channel x Source Interface Identifier" mask="0x00002000" name="SIF" values="XDMAC_CC0__SIF"/>
          <bitfield caption="Channel x Destination Interface Identifier" mask="0x00004000" name="DIF" values="XDMAC_CC0__DIF"/>
          <bitfield caption="Channel x Source Addressing Mode" mask="0x00030000" name="SAM" values="XDMAC_CC0__SAM"/>
          <bitfield caption="Channel x Destination Addressing Mode" mask="0x000C0000" name="DAM" values="XDMAC_CC0__DAM"/>
          <bitfield caption="Channel Initialization Done (this bit is read-only)" mask="0x00200000" name="INITD" values="XDMAC_CC0__INITD"/>
          <bitfield caption="Read in Progress (this bit is read-only)" mask="0x00400000" name="RDIP" values="XDMAC_CC0__RDIP"/>
          <bitfield caption="Write in Progress (this bit is read-only)" mask="0x00800000" name="WRIP" values="XDMAC_CC0__WRIP"/>
          <bitfield caption="Channel x Peripheral Hardware Request Line Identifier" mask="0x7F000000" name="PERID"/>
        </register>
        <register caption="Channel Data Stride Memory Set Pattern (chid = 0)" name="XDMAC_CDS_MSP" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Channel x Source Data stride or Memory Set Pattern" mask="0x0000FFFF" name="SDS_MSP"/>
          <bitfield caption="Channel x Destination Data Stride or Memory Set Pattern" mask="0xFFFF0000" name="DDS_MSP"/>
        </register>
        <register caption="Channel Source Microblock Stride (chid = 0)" name="XDMAC_CSUS" offset="0x30" rw="RW" size="4">
          <bitfield caption="Channel x Source Microblock Stride" mask="0x00FFFFFF" name="SUBS"/>
        </register>
        <register caption="Channel Destination Microblock Stride (chid = 0)" name="XDMAC_CDUS" offset="0x34" rw="RW" size="4">
          <bitfield caption="Channel x Destination Microblock Stride" mask="0x00FFFFFF" name="DUBS"/>
        </register>
      </register-group>
      <register-group name="XDMAC">
        <register caption="Global Type Register" name="XDMAC_GTYPE" offset="0x00" rw="R" size="4">
          <bitfield caption="Number of Channels Minus One" mask="0x0000001F" name="NB_CH"/>
          <bitfield caption="Number of Bytes" mask="0x0000FFE0" name="FIFO_SZ"/>
          <bitfield caption="Number of Peripheral Requests Minus One" mask="0x007F0000" name="NB_REQ"/>
        </register>
        <register caption="Global Configuration Register" name="XDMAC_GCFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Configuration Registers Clock Gating Disable" mask="0x00000001" name="CGDISREG"/>
          <bitfield caption="Pipeline Clock Gating Disable" mask="0x00000002" name="CGDISPIPE"/>
          <bitfield caption="FIFO Clock Gating Disable" mask="0x00000004" name="CGDISFIFO"/>
          <bitfield caption="Bus Interface Clock Gating Disable" mask="0x00000008" name="CGDISIF"/>
          <bitfield caption="Boundary X Kilobyte Enable" mask="0x00000100" name="BXKBEN"/>
        </register>
        <register caption="Global Weighted Arbiter Configuration Register" name="XDMAC_GWAC" offset="0x08" rw="RW" size="4">
          <bitfield caption="Pool Weight 0" mask="0x0000000F" name="PW0"/>
          <bitfield caption="Pool Weight 1" mask="0x000000F0" name="PW1"/>
          <bitfield caption="Pool Weight 2" mask="0x00000F00" name="PW2"/>
          <bitfield caption="Pool Weight 3" mask="0x0000F000" name="PW3"/>
        </register>
        <register caption="Global Interrupt Enable Register" name="XDMAC_GIE" offset="0x0C" rw="W" size="4" atomic-op="set:XDMAC_GIM">
          <bitfield caption="XDMAC Channel 0 Interrupt Enable Bit" mask="0x00000001" name="IE0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Enable Bit" mask="0x00000002" name="IE1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Enable Bit" mask="0x00000004" name="IE2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Enable Bit" mask="0x00000008" name="IE3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Enable Bit" mask="0x00000010" name="IE4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Enable Bit" mask="0x00000020" name="IE5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Enable Bit" mask="0x00000040" name="IE6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Enable Bit" mask="0x00000080" name="IE7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Enable Bit" mask="0x00000100" name="IE8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Enable Bit" mask="0x00000200" name="IE9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Enable Bit" mask="0x00000400" name="IE10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Enable Bit" mask="0x00000800" name="IE11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Enable Bit" mask="0x00001000" name="IE12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Enable Bit" mask="0x00002000" name="IE13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Enable Bit" mask="0x00004000" name="IE14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Enable Bit" mask="0x00008000" name="IE15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Enable Bit" mask="0x00010000" name="IE16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Enable Bit" mask="0x00020000" name="IE17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Enable Bit" mask="0x00040000" name="IE18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Enable Bit" mask="0x00080000" name="IE19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Enable Bit" mask="0x00100000" name="IE20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Enable Bit" mask="0x00200000" name="IE21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Enable Bit" mask="0x00400000" name="IE22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Enable Bit" mask="0x00800000" name="IE23"/>
        </register>
